# GetDisplacedElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetDisplacedElementIds Method
DisplacementElement Class See Also
---
The ids of the elements affected by this DisplacementElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetDisplacedElementIds()
```

Visual Basic
---
```text
Public Function GetDisplacedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetDisplacedElementIds()
```

# ### Return Value
The element ids.
# See Also
DisplacementElement Class
GetDisplacedElementIds Overload
Autodesk.Revit.DB Namespace